---
kind: other
id: Properties.T:Autodesk.Revit.DB.SlabShapeEditor
source: html/fd477da4-a849-5d94-dbd0-3585dc028dac.htm
---
# SlabShapeEditor Properties

Identifies if the slab shape editing functionality is enabled.